<html xmlns="http://www.w3.org/1999/xhtml">
<HEAD>
<TITLE>Insert table button</TITLE>
<link href="style.css" rel="stylesheet" type="text/css">
</HEAD>

<BODY>
<table width="100%" border="0" cellpadding="1" cellspacing="3" class="pageheader">
  <tr> 
    <td><span class="title">Barrierearmen Inhalt erstellen </span></td>
    <td align="right"><a href="index.htm">Inhalt</a></td>
  </tr>
</table>
<hr noshade>
<p>TinyMCE ist in der Lage HTML Inhalte zu erstellen, die auch f&uuml;r Benutzer zug&auml;nglich sind, die eine Behinderung haben, die Text-basierte Browser benutzen und solche die mit abgeschalteten Bildern surfen. </p>
<p>Dinge die Sie tun k&ouml;nnen, um ihren Inhalt barrierearm zu gestalten: </p>
<ol>
  <li>F&uuml;gen Sie eine Bildbeschreibung ein: Blinde Benutzer, oder solche die keine Bilder sehen k&ouml;nnen, werden sich an den Beschreibungen oder Alternativtexten der Bilder orientieren. Wenn ein Bild keine Inhalte enth&auml;lt, wie zum Beispiel eine Dekoration oder ein Platzhalter, lassen sie die Bildbeschreibung leer. TinyMCE wird dann ein leeres Alternativtextattribut einf&uuml;gen, welches die Unterst&uuml;tzungssoftware dazu zwingt die Bilder zu ignorieren. <br>
      <br>
  </li>
  <li>F&uuml;gen Sie Referenzierung in die Kopfzeilen der Tabellen ein: W&auml;hlen Sie Im Tabellenzellen Editorfenster eine Refernzierung um die Datenzellen explizit mit den Kopfzeilen zu verbinden. Durch diese Verbindung ist es f&uuml;r blinde Benutzer einfacher die Tabelle zu verstehen. <br>
      <br>
  </li>
  <li> Strukturieren Sie ihren Inhalt mit &Uuml;berschriften: Im Formatierungs Men&uuml; finden Sie die &Uuml;berschriften 1 bis 6. Nutzen Sie lieber diese Formatierungen als verschiedene Schriftgr&ouml;&szlig;en und andere Formatierungsma&szlig;nahmen um ihren Inhalt zu strukturieren. Blinde Benutzer, die einen Bildschirmleser benutzen, k&ouml;nnen diese &Uuml;berschriften nutzen um sich eine Zusammenfassung des enthaltenen Inhalts generieren und schnell durch die verschiedenen Sektionen der Seite navigieren <br>
      <br>
  </li>
  <li> F&uuml;gen Sie alternative Inhalte ein: Erstellen Sie eine alternative Seite f&uuml;r nicht-HTML Inhalte wie z.B. Flash, Java Applets oder integrierte Videos. Dies kann in Form eines Links zu einer alternativen HTML Seite geschehen. Ein Link zu dieser Seite wird dann in der N&auml;he des nicht-HTML Inhalts plaziert. Dies stellt sicher, dass der Inhalt f&uuml;r solche Nutzer zug&auml;nglich ist die Bedienungshilfen nutzen oder die entsprechenden Plugins nicht installiert haben. <br>
      <br>
  </li>
  <li> &Uuml;berpr&uuml;fen Sie die Barrierefreiheit: Wenn das AChecker Plugin im TinyMCE installiert ist generiert ein Click auf den Check Accessibility Button einen Bericht &uuml;ber die Barrierefreiheit des Inhalts. <br>
      <br>
  </li>
</ol>
<p>&Uuml;berpr&uuml;fen Sie die <a href="http://checker.atrc.utoronto.ca">AChecker Web Site </a> f&uuml;r weitere Details zum Thema "Erstellung barrierearmer Inhalte". <br>
</p>
<hr noshade>
<table width="100%" border="0" cellpadding="1" cellspacing="3" class="pagefooter">
  <tr> 
    <td>Gehe zu: <a href="index.htm">Inhaltsverzeichnis</a></td>
    <td align="right"><a href="#">nach oben</a></td>
  </tr>
</table>
</BODY>
</HTML>
